iPig/src/InformationRegisters/НастройкаКарточкиГруппы/НастройкаКарточкиГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаКарточкиГруппы</name>
  <dimensions>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Название</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСобытия</name>
    <type>
      <types>EnumRef.ТипСобытия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоказатьВКарте</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/НастройкаКарточкиГруппы/Forms/ФормаНастроек/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	НастройкаКарточкиГруппы.Код КАК Код,
	                |	НастройкаКарточкиГруппы.Название КАК Название,
	                |	НастройкаКарточкиГруппы.ТипСобытия КАК ТипСобытия,
	                |	НастройкаКарточкиГруппы.Дни КАК Дни,
	                |	НастройкаКарточкиГруппы.ПоказатьВКарте КАК ПоказатьВКарте
	                |ИЗ
	                |	РегистрСведений.НастройкаКарточкиГруппы КАК НастройкаКарточкиГруппы";
	ТЧДанные.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Процедура ПередЗакрытиемНаСервере()  
	НаборЗаписей = РегистрыСведений.НастройкаКарточкиГруппы.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	Для Каждого Стр ИЗ ТЧДанные Цикл
		НоваяЗапись = РегистрыСведений.НастройкаКарточкиГруппы.СоздатьМенеджерЗаписи();	
		ЗаполнитьЗначенияСвойств(НоваяЗапись,Стр);
		НоваяЗапись.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ПередЗакрытиемНаСервере();
КонецПроцедуры
